recipes/oil-free-hummus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Oil-Free Hummus</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Oil-Free Hummus</h1>
<p>
<a href="https://elavegan.com/oil-free-hummus/">Original link</a>
</p>

<div id="outline-container-orgbf73c43" class="outline-2">
<h2 id="orgbf73c43">Ingredients</h2>
<div class="outline-text-2" id="text-orgbf73c43">
<ul class="org-ul">
<li>One can chickpeas</li>
<li>1/4 cup (60 g) tahini</li>
<li>4 tbsp (40 ml) lemon juice (or more to taste)</li>
<li>1/3 tsp salt or more to taste</li>
<li>1/4 tsp ground cumin</li>
<li>4 tbsp (40 ml) plant-based milk (or more for a creamier hummus)</li>
<li>2-3 small cloves of garlic</li>
<li>1/3 tsp baking soda</li>
<li>Paprika for serving</li>
<li>Fresh parsley for serving</li>
</ul>
</div>
</div>

<div id="outline-container-orgf472882" class="outline-2">
<h2 id="orgf472882">Method</h2>
<div class="outline-text-2" id="text-orgf472882">
<ol class="org-ol">
<li>Rinse and drain canned chickpeas, then place in a medium saucepan and add 1/3 tsp baking soda. Cover chickpeas by at least 2 inches (ca. 5 cm) of water and bring to a boil over high heat. See recipe notes if you want to cook the chickpeas from dry.</li>
<li>Boil the chickpeas for about 15 minutes. Once they look overcooked and slightly mushy, they are ready! Drain the chickpeas in a strainer, rinse with plenty of cool water and set aside.</li>
<li>Process the lemon juice, garlic, salt, cumin, half of the plant-based milk, and tahini in a food processor until the mixture is smooth and creamy. Pause the food processor to scrape down the sides of the processor.</li>
<li>Add the mushy chickpeas to the food processor and blend for about 1-2 minutes, scraping down the sides of the processor as needed.</li>
<li>Now add the remaining plant-based milk and blend for a further 1-2 minutes, or until very smooth, creamy and fluffy.</li>
<li>Taste the hummus and add more salt to taste and more lemon juice, if desired.</li>
<li>Serve in a bowl and top with more lemon juice (I also added a bit of the chickpea cooking water), a dash of paprika (use smoked paprika for a variation), and fresh herbs.</li>
<li>Store leftover hummus covered in the refrigerator for up to 5-6 days.</li>
</ol>
</div>
</div>

<div id="outline-container-org19ad929" class="outline-2">
<h2 id="org19ad929">Notes</h2>
<div class="outline-text-2" id="text-org19ad929">
<ul class="org-ul">
<li>If you don't want to use canned chickpeas you can cook them from dry. Here is how:</li>
<li>In a medium bowl, cover 3/4 cup (150 grams) dried chickpeas by at least 5 cm of cold water.</li>
<li>Add 1/2 tsp baking soda and let soak at room temperature overnight. Drain and rinse.</li>
<li>In a medium pot, cover soaked chickpeas by about 10 cm of water.</li>
<li>Add 1/2 tsp baking soda and bring to a boil over high heat.</li>
<li>Reduce the heat and simmer until chickpeas are soft, about 1 1/2 hours.</li>
<li>Drain and rinse under running water.</li>
<li>Recipe serves 6.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
